{
  "title": "Impulsive Axisymmetric Forcing in a Rotating Cylinder, Reversible Swirl Response, and Skyrmionic Photon Fields: Fluid Benchmarks and Fluid-Inspired Kinematic Hypotheses",
  "creators": [
    {
      "name": "Iskandarani, Omar",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "<p>This article is divided into two parts. Part I analyzes a rotating-tank experiment in which a short, axisymmetric impulse from a bottom impeller in a uniformly rotating cylinder produces a delayed &ldquo;push&ndash;pull&rsquo;&rsquo; signal on the free surface: a localized depression followed by a localized rise on the rotation axis. Using linear rotating Euler theory and standard inertial-wave dispersion \\(\\omega = 2\\Omega k_z/k\\), the work constructs an axisymmetric inertial-wave packet whose vertical group velocity \\(c_{g,z}\\) quantitatively explains the measured arrival time \\(t_{\\mathrm{arr}} \\simeq H/c_{g,z}\\) and its scaling \\(t_{\\mathrm{arr}} \\propto \\Omega^{-1}\\). Hydrostatic coupling at the free surface, \\(p'(z=H) + \\rho g\\,\\eta = 0\\), accounts for the observed bipolar surface elevation. The paper further derives a kinematic link between vertical displacement and vertical vorticity, \\(\\omega_z = 2\\Omega\\,\\partial_z \\xi\\), and shows how axisymmetric vertical forcing generates an azimuthal swirl field \\(u_\\theta(r,z,t)\\). For symmetric up&ndash;down forcing cycles with zero net displacement, the net azimuthal angle change is shown to vanish to leading order, demonstrating a nearly reversible swirl response in the inviscid, linear regime. Several falsifiable scaling and symmetry checks within mainstream rotating-fluid theory are listed. Part II then turns to structured light, reviewing how skyrmionic photon fields are characterized by an integer topological charge \\(N_{\\mathrm{sk}}^{(\\mathrm{ph})}\\) built from a normalized Stokes vector on the Poincar&eacute; sphere, and introducing an analogous vorticity-based surface invariant \\(H_{\\mathrm{vortex}}[\\hat{\\boldsymbol{\\omega}}|\\Sigma]\\) constructed from the unit vorticity direction. The formal equivalence of these Chern-number-like integrals motivates a topological correspondence between knotted vorticity textures and optical skyrmion textures, and a schematic projection from vorticity to optical modes is written down as a consistency requirement rather than a detailed emission model. Throughout, the fluid benchmarks rely only on standard rotating-flow theory, while fluid-inspired kinematic time-rate hypotheses and the vorticity&ndash;photon mapping are clearly flagged as speculative outlooks built on top of established macroscopic equations.</p>",
  "keywords": [],
  "publication_date": "2025-11-15",
  "doi": "10.5281/zenodo.17619170",
  "tex_file": "SST-10_Impulsive_Axisymmetric_Forcing\\SST-10_Impulsive_Axisymmetric_Forcing_in_a_Rotating_Cylinder.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "access_right": "open",
  "license": {
    "id": "cc-by-4.0"
  },
  "deposit_id": "17619170",
  "language": "eng",
  "communities": [
    {
      "id": "sst"
    }
  ]
}