{
  "title": "Thermodynamics of the Swirl Condensate:\\\\ Temperature, Heat, and the Geometric Deformation of Equilibrium Boundaries in Swirl--String Theory",
  "creators": [
    {
      "name": "Omar Iskandarani",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "In Swirl--String Theory (SST), a bound electronic state is represented by a closed swirl filament whose geometry contains two intrinsic length scales: the core radius \\(r_c\\), which characterises the topological filament itself, and the Bohr radius \\(a_0\\), which sets the equilibrium size of the Coulomb envelope. Although previous SST thermodynamic formulations were expressed solely in terms of \\(r_c\\), a physically complete treatment of atomic systems requires both scales. Using the canonical SST relation\n        \\[\n            a_0 = {2\\,_{\\!}\\, r_c ,\n        \\]\n        we show that \\(a_0\\) is not an independent constant but an emergent, dynamically coupled outer boundary of the ground--state hydrogen torus. This leads naturally to a two--scale swelling theory in which thermodynamic deformation involves simultaneous variations of the core and orbital radii, \\((r,R)=(r_c,a_0)} = {r_c} {a_0},\n        \\]\n        showing that orbital and core strains coincide to first order because \\(a_0\\) inherits its variation from \\(r_c\\). The resulting enthalpy \\(H_{}(R,r)\\) produces an effective stiffness\n        \\[\n            K_{ = K_{RR}a_0^2 + 2K_{Rr}a_0 r_c + K_{rr} r_c^2,\n        \\]\n        yielding a low--temperature equation of state\n        \\[\n            E(T_{})-E(0)}^2,\n            },\n        \\]\n        with both thermodynamic and chronometric behaviour dominated by the coupling between the two geometric scales. This framework unifies swelling dynamics, heat capacity, and swirl--clock time dilation in a single analytic structure, providing a consistent thermodynamic description of hydrogen and establishing a foundation for SST--based models of atomic stability and excitation.",
  "keywords": [],
  "publication_date": "",
  "doi": "10.5281/zenodo.18388672",
  "tex_file": "SST-34_Thermodynamics_of_the_Swirl_Condensate.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "deposit_id": "18388672",
  "language": "eng"
}