{
  "title": "Unification of Relativistic Kinematics and Gravitational Dynamics from a Single Covariant Action",
  "creators": [
    {
      "name": "Omar Iskandarani",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "Special relativity, general relativity, and the universality of free fall are\n                usually introduced as conceptually distinct principles: Lorentz invariance as a\n                kinematical symmetry, Einstein gravity as a dynamical theory of spacetime, and\n                the equivalence principle as an independent postulate.\n                In this work we show that these elements are not logically independent.\n\n                We consider a minimal covariant action consisting of the Einstein--Hilbert term,\n                a unit timelike vector field subject to a normalization constraint, and\n                minimally coupled matter.\n                Without assuming Lorentz invariance, geodesic motion, or the equivalence\n                principle , we demonstrate that all three arise as necessary\n                consequences of diffeomorphism invariance and the variational structure of the\n                theory.\n\n                We prove that local kinematics reduce to special relativity in the tangent space\n                at every spacetime point, yielding the standard Lorentz factor\n                \\[.\n                We further show that the field equations take the Einstein form with a\n                covariantly conserved total stress--energy tensor, and that the universality of\n                free fall follows directly from minimal coupling and the Bianchi identity.\n                General relativity is recovered as a consistent sector of the theory, while\n                controlled deviations are naturally parameterized by the additional timelike\n                sector.\n\n                These results clarify the minimal structural conditions under which relativistic\n                physics emerges and demonstrate that special-relativistic kinematics, Einstein\n                gravity, and the weak equivalence principle can be unified within a single\n                covariant framework, rather than postulated as independent foundations.\\]",
  "keywords": [
    "einstein",
    "lorentz"
  ],
  "publication_date": "",
  "doi": "10.5281/zenodo.18388712",
  "tex_file": "SST-62_SR_GR_ARE_ONE\\SST-62_SR_GR_ARE_ONE.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "deposit_id": "18388712",
  "language": "eng"
}