{
  "title": "Multi-Scale Thermodynamics of the Swirl Condensate: A Unified Hydrodynamic-Topological Framework for Swirl-String Theory",
  "creators": [
    {
      "name": "Iskandarani, Omar",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "<div>\n<pre>We develop a comprehensive thermodynamic formulation of Swirl--String Theory (SST),<br>in which the physical vacuum is modeled as a frictionless, incompressible swirl<br>condensate, and all matter arises as topologically stabilized vortex filaments<br>(``swirl strings''). Building on the quantum--thermodynamic isomorphism of Abe \\&amp;<br>Okuyama, we demonstrate that hydrogenic structure, particle masses, vacuum<br>fluctuations, and interaction lifetimes can be reinterpreted as thermodynamic<br>processes involving the swelling, compression, and mode--excitation of vortex<br>cores.<br><br>We define SST Work as the mechanical energy required to deform the vortex core<br>radius against the surrounding swirl pressure, and SST Heat as the energy<br>redistributed among Kelvin modes and topological phase channels. Applying this<br>framework to hydrogen, we show that the Bohr radius is not a probabilistic orbital<br>shell but a thermodynamic equilibrium surface where centrifugal swirl pressure<br>balances vacuum tension.<br><br>We reinterpret the Golden Layer mass hierarchy as a discrete thermodynamic<br>scaling law governed by the golden ratio, emerging from log--periodic structure in<br>the swirl energy density. The Unruh Echo is shown to arise from a two--stage<br>thermodynamic response: a 0.1 ns vorticity burst followed by a delayed<br>electromagnetic transduction pulse around 30 ns. Finally, we derive partition<br>functions, heat capacities, and provide numerical evaluation for a simplified<br>Golden ladder.</pre>\n</div>",
  "keywords": [
    "golden"
  ],
  "publication_date": "2025-12-04",
  "doi": "10.5281/zenodo.17813283",
  "tex_file": "SST-24_Thermodynamics\\SST-24_Thermodynamics.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "access_right": "open",
  "license": {
    "id": "cc-by-4.0"
  },
  "deposit_id": "17813283",
  "language": "eng",
  "communities": [
    {
      "id": "sst"
    }
  ]
}