{
  "title": "Long-Distance Swirl Gravity from Chiral Swirling Knots with Central Holes",
  "creators": [
    {
      "name": "Iskandarani, Omar",
      "affiliation": null,
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "<p>This paper <strong>derives long-range gravitational attraction in Swirl&ndash;String Theory (SST)</strong> as a direct consequence of chiral swirling knots &mdash; topological filament structures such as the trefoil, cinquefoil, and stevedore knots. Each knot encloses a central rotational line that anchors circulation, leading to quantized loop integrals via <strong>Cauchy&rsquo;s theorem</strong>. Using this quantization, we demonstrate how <strong>multiple quark </strong>knots merge into composite baryon tubes with additive circulation, predicting correct baryon mass scaling.</p>\n<p>We show that two composite tubes sharing the same central line produce a deeper pressure well, providing <strong>a flat-space explanation for molecular attraction </strong>(e.g. in H₂). The work embeds SST in an <strong>entropic-gravity</strong> framework, mapping swirl density to local information content, circulation to mass, and swirl clock slowdown to gravitational redshift. A <strong>Lagrangian</strong> and <strong>action </strong>formulation is presented, yielding <strong>Euler&ndash;Lagrange</strong> dynamics for the swirl fields.</p>\n<p>Finally, we propose experimental tests: EMF-time impulse detection during vortex nucleation, spectroscopy of hydrogenic systems to probe local time dilation, and circulation quantization verification in composite tubes. This establishes a falsifiable, flat-space, topological mechanism for gravitational attraction without invoking spacetime curvature.</p>\n<p><strong>Keywords: </strong>Swirl&ndash;String Theory, Topological Gravity, Circulation Quantization, Composite Baryon Tubes, Entropic Gravity, Hydrogen Molecule Binding, Flat-Space Field Theory</p>\n<p><strong>Version: </strong>v0.0.3&nbsp;&nbsp;<br><strong>DOI: </strong>10.5281/zenodo.17204124&nbsp;<br><strong>Author: </strong>Omar Iskandarani &nbsp;<br><strong>Affiliation: </strong>Independent Researcher, Groningen, The Netherlands &nbsp;</p>",
  "keywords": [],
  "publication_date": "2025-10-11",
  "doi": "10.5281/zenodo.17328593",
  "tex_file": "SST-34_Hydrogen-Gravity\\SST-34_Hydrogen-Gravity.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "access_right": "open",
  "license": {
    "id": "cc-by-4.0"
  },
  "deposit_id": "17328593",
  "language": "eng",
  "communities": [
    {
      "id": "sst"
    }
  ]
}