{
  "title": "Helicity-Constrained Stability Beyond Energy Minimization",
  "creators": [
    {
      "name": "Omar Iskandarani",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "Stability in classical continuum systems is commonly associated with energetic\n            optimality, whereby persistent configurations correspond to minima of an\n            appropriate energy functional. However, ideal incompressible flows admit\n            long-lived localized structures that do not satisfy this criterion. In\n            particular, knotted vortex filaments have been observed to persist for many\n            characteristic times despite not corresponding to energy-minimizing states.\n\n            In this work, we show that the longevity of knotted vortex filaments in ideal\n            incompressible flows arises from topological constraints imposed by helicity\n            conservation, rather than energetic optimality. By analyzing helicity as an\n            active dynamical constraint, we demonstrate that conserved topological\n            invariants restrict admissible decay pathways and obstruct continuous\n            transitions between distinct topological classes. As a result, knotted\n            configurations remain stable in the sense of long-term persistence, even while\n            undergoing continuous dynamical evolution.\n\n            We distinguish energetic stability from topological stability and show that the\n            latter provides an independent mechanism for robustness in classical continuum\n            systems. Knotted vortex filaments exemplify this mechanism, persisting far from\n            energetic equilibrium due to the structure of the admissible configuration\n            space defined by the Euler equations. These results clarify the role of topology\n            in classical fluid dynamics and suggest that conserved topological quantities\n            should be regarded as fundamental contributors to stability, robustness, and\n            structure formation in ideal and near-ideal flows.",
  "keywords": [],
  "publication_date": "",
  "doi": "10.5281/zenodo.18388706",
  "tex_file": "SST-61_Topological_Stabilization_Ideal_Flows\\SST-61_topological_stabilization_ideal_flows.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "deposit_id": "18388706",
  "language": "eng"
}