{
  "title": "Hydrodynamic Origin of the Hydrogen Ground State",
  "creators": [
    {
      "name": "Iskandarani, Omar",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "<div>\n<pre>This research report presents a comprehensive derivation of the hydrogen ground state within the framework of Swirl-String Theory (SST), a hydrodynamic effective field theory that models the vacuum not as an abstract geometric manifold or a probabilistic quantum field, but as a frictionless, incompressible, superfluid-like condensate. By identifying the electron and proton as topologically stable knotted vortex filaments (``swirl strings'') characterized by quantized circulation, the theory recovers the phenomenological predictions of quantum mechanics and general relativity from purely classical fluid-mechanical and topological constraints. The report rigorously establishes the ``Swirl-Coulomb'' potential from the Euler equations of the medium, demonstrating that the \\(1/r\\) electrostatic interaction emerges inevitably from the pressure gradients induced by conserved circulation. Furthermore, the analysis unifies the classical electron radius, the Compton wavelength, and the Bohr radius through a single harmonic oscillator construction rooted in the medium's parameters.\\footnote{A full derivation of this construction is given in Ref.~\\cite{IskandaraniUnifiedElectronScale2025}.} The derivation yields the hydrogen ground state energy \\(E_B\\) and the fine-structure constant \\(\\alpha\\) as emergent geometric ratios, achieving a parameter-free recovery of the Rydberg scale given the medium's calibration. We further extend this analysis to the N1&ndash;N2 excitation spectrum, interpreting spectral lines as acoustic resonance shifts caused by the deceleration of the electron knot from its maximum laminar speed. Finally, we derive the mass of the proton from the topological volume of its constituent knots, providing a geometric basis for the hadronic spectrum. This work thereby offers a realist, local, and deterministic account of atomic stability, contrasting sharply with the probabilistic postulates of standard quantum theory while maintaining mathematical consistency with established spectroscopy.</pre>\n</div>",
  "keywords": [],
  "publication_date": "2025-11-26",
  "doi": "10.5281/zenodo.17728292",
  "tex_file": "SST-21_Knot_Taxonomy\\SST-21_Knot_Taxonomy.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "access_right": "open",
  "license": {
    "id": "cc-by-4.0"
  },
  "deposit_id": "17728292",
  "language": "eng",
  "communities": [
    {
      "id": "sst"
    }
  ]
}