{
  "title": "Relational Time-of-Arrival as a Covariant Field Observable: From Event Currents to a Continuum Clock Limit",
  "creators": [
    {
      "name": "Iskandarani, Omar",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "<p>The definition of time observables in quantum theory remains conceptually unsettled. In nonrelativistic quantum mechanics, Pauli-type arguments obstruct the existence of a self-adjoint time operator conjugate to energy, while in relativistic quantum field theory (QFT) localization, causality, and observer dependence further complicate the notion of time-of-arrival (TOA). Existing approaches&mdash;such as POVM-based constructions and detector models&mdash;are operationally effective but typically depend on specific measurement schemes or preferred time parameters.</p>\n<p>This work introduces a <strong>relational and manifestly covariant formulation of time-of-arrival</strong> in QFT. Rather than postulating a universal time operator, TOA is defined as a <strong>field-functional</strong> constructed from two conserved structures:<br>(i) a conserved matter current encoding detector crossings, and<br>(ii) a conserved event current whose integral defines a discrete event-count clock.</p>\n<p>Under controlled coarse-graining, the discrete clock admits a continuum limit described by a scalar clock field governed by an effective field theory (EFT). This provides a unified ultraviolet&ndash;infrared hierarchy linking integer-valued event counts to smooth clock readings, while remaining compatible with Hamiltonians bounded from below.</p>\n<p>A general relational TOA distribution is derived by binning detector flux with respect to the physical clock field evaluated on the detector world-tube. The resulting observable is covariant and independent of detector microphysics up to the detector geometry and matter current. In a worked <span><span>1+11+1</span><span><span><span>1</span><span>+</span></span><span><span>1</span></span></span></span>-dimensional example, the TOA distribution appears explicitly as a convolution of the semiclassical matter flux with clock-sector correlations, yielding predictive arrival-time broadening. The variance is fixed by clock fluctuations, while early-arrival contributions are shown to be exponentially suppressed with a scale determined by the clock-sector mass parameter.</p>\n<p>An appendix derives this exponential envelope from standard massive propagator asymptotics, clarifying the distinction between local (Gaussian) clock noise and nonlocal correlation bounds. A concrete realization motivated by Swirl-String Theory (SST) is presented as an example, identifying the event current with defect worldlines and the clock field with a foliation scalar, though the relational construction itself remains model-independent.</p>\n<p>The framework isolates a sharpened notion of detector-independence and provides a predictive, falsifiable program for time-of-arrival observables in relativistic quantum theory, with direct applicability to analytical and numerical studies across resolutions.</p>\n<h2>Keywords</h2>\n<p>time of arrival; relational time; quantum time observables; covariant observables; event currents; quantum field theory; effective field theory</p>\n<h2>Notes</h2>\n<ul>\n<li>\n<p>Single-file LaTeX source (Springer <code>sn-jnl</code> class)</p>\n</li>\n<li>\n<p>Includes worked example and analytic appendix</p>\n</li>\n<li>\n<p>Suitable for Foundations of Physics, Annals of Physics, or related journals</p>\n</li>\n</ul>\n<h2>License</h2>\n<p>&copy; 2025 Omar Iskandarani.<br>This work is made available for academic reading and citation. Redistribution or derivative works are not permitted without explicit permission. (Adjust if you prefer a Creative Commons license.)</p>\n<h2>Citation</h2>\n<p>O. Iskandarani, <em>Relational Time-of-Arrival as a Covariant Field Observable: From Event Currents to a Continuum Clock Limit</em>, Zenodo (2025).</p>",
  "keywords": [
    "\\paperkeywords"
  ],
  "publication_date": "2025-12-24",
  "doi": "10.5281/zenodo.18050158",
  "tex_file": "SST-46_Relational_Time_of_Arrival\\SST-46_Relational_Time-of-Arrival_from_an_Event_Current_and_its_Continuum_Clock_Limit.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "access_right": "open",
  "license": {
    "id": "cc-by-4.0"
  },
  "deposit_id": "18050158",
  "language": "eng"
}