{
  "title": "Hydrodynamic Origin of the Hydrogen Ground State",
  "creators": [
    {
      "name": "Omar Iskandarani",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "Historically, the idea of as a primitive physical quantity dates back to 19th-century hydrodynamics. In 1858, Hermann von Helmholtz proved that vortex lines in an inviscid fluid move as indestructible tubes—their vorticity and circulation are conserved in time. A decade later, William Thomson (Lord Kelvin) formalized the conservation of circulation with his famous theorem: {dt} = 0 for any material loop in a barotropic ideal fluid. Kelvin went further to propose that atoms might in fact be knotted vortex rings in a universal ether, each with a quantized circulation “charge”. This bold vortex atom model elevated the line-integral of velocity (circulation) to a candidate fundamental invariant of nature. The legacy of Helmholtz and Kelvin is a recognition that —a concept that Swirl String Theory (SST) adopts as a central postulate. In SST, matter is modeled as stable swirl strings (closed vortex filaments) in a pervasive incompressible medium. It is thus natural to take circulation (the strength of these vortices) as a primitive quantity. We seek a fundamental circulation constant, \\( r_e = {m_e c} This yields a force magnitude: F_{ = {r_e} = { where \\)m_e\\( is the electron mass, \\)c\\( the speed of light, \\) \\( is an empirical force scale appearing in the SST canon (listed as the EM-sector maximum force). Physically, it represents the self-interaction force scale of an electron’s charge in classical electromagnetism, and in some formulations it’s viewed as an upper limit for force transmissible in that sector. In the context of the swirl medium, we posit that an equivalent force scale should emerge from the medium’s fundamental parameters. Dimensional analysis suggests that the combination \\) {L^3}{T^2}{T^2}\\(, the dimensions of force. We therefore impose the relation F_{ = where \\[ is the mass density of the swirl medium and \\) }{}} By choosing \\] force when combined with the medium density. Using the calibrated SST density \\( = 7.0~^3\\), we find: }{7.0~^3}} ^2}{} This fundamenta",
  "keywords": [
    "kelvin",
    "helmholtz"
  ],
  "publication_date": "2026-01-27",
  "doi": "10.5281/zenodo.18388653",
  "tex_file": "SST-20_Short_Hydrodynamic_Origin\\SST-20_Short_Hydrodynamic_Origin_of_the_Hydrogen_Ground_State.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "deposit_id": "18388653",
  "language": "eng"
}