{
  "title": "A Unified Electron Scale Relation from Classical Radius, Compton Frequency, and the Hydrogen Ground State Energy",
  "creators": [
    {
      "name": "Iskandarani, Omar",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "<p>This manuscript derives and analyzes an exact algebraic identity linking three standard electron scales that usually appear in separate parts of the physics curriculum: the classical electron radius \\(r_e\\), the Compton angular frequency \\(\\omega_C\\), and the hydrogen ground-state energy \\(E_B\\). Using only textbook definitions and CODATA values of \\(m_e\\), \\(\\alpha\\), \\(\\hbar\\), and \\(c\\), the author constructs a purely classical Hooke-law oscillator with electron mass \\(m_e\\), frequency \\(\\omega_\\ast = \\omega_C/\\alpha\\), and amplitude equal to the classical radius \\(r_e\\). This oscillator defines a maximal restoring force<br>\\[<br>F_{\\max} = m_e\\left(\\frac{\\omega_C}{\\alpha}\\right)^2 r_e,<br>\\]<br>which can be written entirely in terms of fundamental constants. The central result is that there exists a Compton-scale radius \\(r_c\\) such that<br>\\[<br>F_{\\max} r_c = \\frac{1}{2} m_e c^2 = \\frac{E_B}{\\alpha^2},<br>\\]<br>so that the half electron rest energy and the Bohr ground-state energy (rescaled by \\(\\alpha^{-2}\\)) emerge from a single, dimensionally consistent construction involving \\(r_e\\) and \\(\\omega_C\\). The paper carefully states all standard definitions (fine-structure constant, classical electron radius, Compton wavelength/frequency, Bohr energy), performs explicit dimensional checks, and evaluates the identity numerically using CODATA 2014 constants. A short historical discussion recalls the independent origins of these scales in classical electron models (Lorentz&ndash;Abraham), Compton scattering, and Bohr/Schr&ouml;dinger hydrogen theory. No new physical model or modification of quantum electrodynamics is proposed; the work is presented explicitly as a compact consistency relation among well-established electron scales, intended to clarify structural interdependencies between classical electrodynamics, relativistic kinematics, and atomic physics.</p>",
  "keywords": [
    "rayleigh",
    "jeans"
  ],
  "publication_date": "2025-11-17",
  "doi": "10.5281/zenodo.17629932",
  "tex_file": "SST-15_Circulation_Loop_Thermodynamics\\SST-15_Thermodynamics_of_a_Circulation-Loop_Gas_in_an_Incompressible_Fluid_and_the_Classical_Ultraviolet_Problem.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "access_right": "open",
  "license": {
    "id": "cc-by-4.0"
  },
  "deposit_id": "17629932",
  "language": "eng",
  "communities": [
    {
      "id": "sst"
    }
  ]
}