{
  "title": "Circulation, Rigid Rotation, and Proper Time Dilation: A Fluid-Mechanical Representation of Kinematic Redshift",
  "creators": [
    {
      "name": "Iskandarani, Omar",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "<p>This article presents a fluid-mechanical representation of special-relativistic time dilation for circular motion, expressed in terms of vorticity and circulation. Starting from the Minkowski metric in cylindrical coordinates, we derive the standard proper-time factor for uniform circular motion, \\( \\mathrm{d}\\tau/\\mathrm{d}t = \\sqrt{1 - v^2/c^2} \\) with \\( v = \\Omega r \\), and then specialize to an incompressible, inviscid fluid in rigid-body rotation. For the velocity field \\( \\boldsymbol{v}(r) = \\Omega r\\,\\hat{\\boldsymbol{\\theta}} \\), the circulation around a circle of radius \\( r \\) is \\( \\Gamma(r) = 2\\pi \\Omega r^2 \\), which allows the kinematic time-dilation factor to be rewritten as \\( \\mathrm{d}\\tau/\\mathrm{d}t = \\sqrt{1 - \\Gamma^2/(4\\pi^2 r^2 c^2)} \\). Because circulation is conserved for inviscid, barotropic flows with conservative body forces (Kelvin&rsquo;s theorem), this form ties proper time directly to a topological invariant of the flow. The paper compares this purely kinematic scaling to the weak-field Schwarzschild time-dilation factor for circular orbits, and illustrates orders of magnitude for terrestrial rotation and GPS-like satellite speeds. The analysis is strictly within mainstream special relativity, elementary general relativity, and classical fluid mechanics, and is intended as a pedagogical bridge rather than a modification of gravitational theory.</p>",
  "keywords": [],
  "publication_date": "2025-11-15",
  "doi": "10.5281/zenodo.17619187",
  "tex_file": "SST-08_Circulation_Rigid_Rotation\\SST-08_Circulation_Rigid_Rotation_and_Proper_Time_Dilation.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "access_right": "open",
  "license": {
    "id": "cc-by-4.0"
  },
  "deposit_id": "17619187",
  "language": "eng",
  "communities": [
    {
      "id": "sst"
    }
  ]
}