{
  "title": "Non-Thermal Field Coupling in Swirl–String Theory: Nuclear Access and Gravity Modulation",
  "creators": [
    {
      "name": "Omar Iskandarani",
      "affiliation": "Independent Researcher, Groningen, The Netherlands",
      "orcid": "0009-0006-1686-3961"
    }
  ],
  "description": "SST Nuclear Modeling – Knotted Swirl Strings: In Swirl–String Theory (SST), every particle is a closed vortex filament (“swirl string”) in an incompressible fluid-like medium. Nucleons (protons, neutrons) are modeled as : for example, the proton is a linked triple-knot \\(p=(5_2 + 5_2 + 6_1)\\) and the neutron \\(n=(5_2 + 6_1 + 6_1)\\), corresponding to their quark content vs . These torus/hyperbolic knots carry topological quantum numbers (mass, charge, spin) as invariants of the string’s geometry. Atomic nuclei are then bound states of multiple linked swirl strings – essentially representing each nucleon. The SST Canon describes nuclei as composite links with a built-in “periodic table” of allowed link structures. When knots link, their swirl flows intertwine, stabilizing the bound state and producing a small mass deficit (binding energy) relative to free nucleons. In SST interpretation, this mass defect is the stored in shared swirl fields rather than in separate particles. Thus, rest mass arises from core swirl energy (kinetic energy of the fluid in a knotted vortex core), while binding energy reflects a reduction in total swirl energy when strings link (the swirling fields partially cancel or entrain each other). The core swirl energy density \\(u = {2}} v_{!^2\\) at a string’s center is tied to its invariant mass, whereas inter-string linkages modify the effective swirl energy distribution, lowering the composite mass. Swirl-Pressure and Swirl-Clock Effects: Each swirl string maintains a pressure profile in the fluid medium. Rapid circulation creates a low-pressure core (like a vortex in a fluid), which in SST acts analogously to a potential well. This swirl pressure gradient is central to SST’s gravity mechanism and internal forces. Indeed, integrating the fluid’s swirl-pressure around a vortex yields the “swirl Coulomb constant” \\( (analogous to Coulomb or gravitational potential). In hydrogen, \\)v\\( comes out on the order of \\)10^{-45} J·m – the correct scale for atomic b",
  "keywords": [
    "swirl",
    "coulomb"
  ],
  "publication_date": "",
  "doi": "10.5281/zenodo.18388643",
  "tex_file": "SST-16_Non_Thermal_Field_Coupling\\SST-16_Non_Thermal_Field_Coupling.tex",
  "upload_type": "publication",
  "publication_type": "preprint",
  "deposit_id": "18388643",
  "language": "eng"
}